; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-36)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 room5 left right ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 ball19 ball20 ball21 ball22 ball23 ball24 ball25 ball26 ball27 ball28 ball29 ball30 ball31 ball32 ball33 ball34 ball35 ball36 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(room room5)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(ball ball15)
(ball ball16)
(ball ball17)
(ball ball18)
(ball ball19)
(ball ball20)
(ball ball21)
(ball ball22)
(ball ball23)
(ball ball24)
(ball ball25)
(ball ball26)
(ball ball27)
(ball ball28)
(ball ball29)
(ball ball30)
(ball ball31)
(ball ball32)
(ball ball33)
(ball ball34)
(ball ball35)
(ball ball36)
(free left)
(free right)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 roomb)
(at ball8 roomb)
(at ball9 roomb)
(at ball10 roomb)
(at ball11 roomb)
(at ball12 roomb)
(at ball13 roomb)
(at ball14 room3)
(at ball15 room3)
(at ball16 room4)
(at ball17 room4)
(at ball18 room4)
(at ball19 room4)
(at ball20 room4)
(at ball21 room4)
(at ball22 room4)
(at ball23 room4)
(at ball24 room4)
(at ball25 room5)
(at ball26 room5)
(at ball27 room5)
(at ball28 room5)
(at ball29 room5)
(at ball30 room5)
(at ball31 room5)
(at ball32 room5)
(at ball33 room5)
(at ball34 room5)
(at ball35 room5)
(at ball36 room5)
(at-robby rooma)
)
(:goal
(and
(at ball1 roomb)
(at ball2 roomb)
(at ball3 roomb)
(at ball4 roomb)
(at ball5 roomb)
(at ball6 roomb)
(at ball7 roomb)
(at ball8 roomb)
(at ball9 roomb)
(at ball10 roomb)
(at ball11 roomb)
(at ball12 roomb)
(at ball13 roomb)
(at ball14 roomb)
(at ball15 roomb)
(at ball16 roomb)
(at ball17 roomb)
(at ball18 roomb)
(at ball19 roomb)
(at ball20 roomb)
(at ball21 roomb)
(at ball22 roomb)
(at ball23 roomb)
(at ball24 roomb)
(at ball25 roomb)
(at ball26 roomb)
(at ball27 roomb)
(at ball28 roomb)
(at ball29 roomb)
(at ball30 roomb)
(at ball31 roomb)
(at ball32 roomb)
(at ball33 roomb)
(at ball34 roomb)
(at ball35 roomb)
(at ball36 roomb)
)
)
)

; plan
1. (pick ball6 rooma left)
   deleted: (at ball6 rooma) (free left)
   added: (carry ball6 left)
   goals met: 7 of 36
2. (pick ball5 rooma right)
   deleted: (at ball5 rooma) (free right)
   added: (carry ball5 right)
   goals met: 7 of 36
3. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 7 of 36
4. (drop ball5 roomb right)
   deleted: (carry ball5 right)
   added: (at ball5 roomb) (free right)
   goals met: 8 of 36
5. (drop ball6 roomb left)
   deleted: (carry ball6 left)
   added: (at ball6 roomb) (free left)
   goals met: 9 of 36
6. (move roomb room5)
   deleted: (at-robby roomb)
   added: (at-robby room5)
   goals met: 9 of 36
7. (pick ball36 room5 left)
   deleted: (at ball36 room5) (free left)
   added: (carry ball36 left)
   goals met: 9 of 36
8. (pick ball35 room5 right)
   deleted: (at ball35 room5) (free right)
   added: (carry ball35 right)
   goals met: 9 of 36
9. (move room5 roomb)
   deleted: (at-robby room5)
   added: (at-robby roomb)
   goals met: 9 of 36
10. (drop ball35 roomb right)
   deleted: (carry ball35 right)
   added: (at ball35 roomb) (free right)
   goals met: 10 of 36
11. (drop ball36 roomb left)
   deleted: (carry ball36 left)
   added: (at ball36 roomb) (free left)
   goals met: 11 of 36
12. (move roomb room5)
   deleted: (at-robby roomb)
   added: (at-robby room5)
   goals met: 11 of 36
13. (pick ball34 room5 left)
   deleted: (at ball34 room5) (free left)
   added: (carry ball34 left)
   goals met: 11 of 36
14. (pick ball33 room5 right)
   deleted: (at ball33 room5) (free right)
   added: (carry ball33 right)
   goals met: 11 of 36
15. (move room5 roomb)
   deleted: (at-robby room5)
   added: (at-robby roomb)
   goals met: 11 of 36
16. (drop ball33 roomb right)
   deleted: (carry ball33 right)
   added: (at ball33 roomb) (free right)
   goals met: 12 of 36
17. (drop ball34 roomb left)
   deleted: (carry ball34 left)
   added: (at ball34 roomb) (free left)
   goals met: 13 of 36
18. (move roomb room5)
   deleted: (at-robby roomb)
   added: (at-robby room5)
   goals met: 13 of 36
19. (pick ball32 room5 left)
   deleted: (at ball32 room5) (free left)
   added: (carry ball32 left)
   goals met: 13 of 36
20. (pick ball31 room5 right)
   deleted: (at ball31 room5) (free right)
   added: (carry ball31 right)
   goals met: 13 of 36
21. (move room5 roomb)
   deleted: (at-robby room5)
   added: (at-robby roomb)
   goals met: 13 of 36
22. (drop ball31 roomb right)
   deleted: (carry ball31 right)
   added: (at ball31 roomb) (free right)
   goals met: 14 of 36
23. (drop ball32 roomb left)
   deleted: (carry ball32 left)
   added: (at ball32 roomb) (free left)
   goals met: 15 of 36
24. (move roomb room5)
   deleted: (at-robby roomb)
   added: (at-robby room5)
   goals met: 15 of 36
25. (pick ball30 room5 left)
   deleted: (at ball30 room5) (free left)
   added: (carry ball30 left)
   goals met: 15 of 36
26. (pick ball29 room5 right)
   deleted: (at ball29 room5) (free right)
   added: (carry ball29 right)
   goals met: 15 of 36
27. (move room5 roomb)
   deleted: (at-robby room5)
   added: (at-robby roomb)
   goals met: 15 of 36
28. (drop ball29 roomb right)
   deleted: (carry ball29 right)
   added: (at ball29 roomb) (free right)
   goals met: 16 of 36
29. (drop ball30 roomb left)
   deleted: (carry ball30 left)
   added: (at ball30 roomb) (free left)
   goals met: 17 of 36
30. (move roomb room5)
   deleted: (at-robby roomb)
   added: (at-robby room5)
   goals met: 17 of 36
31. (pick ball28 room5 left)
   deleted: (at ball28 room5) (free left)
   added: (carry ball28 left)
   goals met: 17 of 36
32. (pick ball27 room5 right)
   deleted: (at ball27 room5) (free right)
   added: (carry ball27 right)
   goals met: 17 of 36
33. (move room5 roomb)
   deleted: (at-robby room5)
   added: (at-robby roomb)
   goals met: 17 of 36
34. (drop ball27 roomb right)
   deleted: (carry ball27 right)
   added: (at ball27 roomb) (free right)
   goals met: 18 of 36
35. (drop ball28 roomb left)
   deleted: (carry ball28 left)
   added: (at ball28 roomb) (free left)
   goals met: 19 of 36
36. (move roomb room5)
   deleted: (at-robby roomb)
   added: (at-robby room5)
   goals met: 19 of 36
37. (pick ball26 room5 left)
   deleted: (at ball26 room5) (free left)
   added: (carry ball26 left)
   goals met: 19 of 36
38. (pick ball25 room5 right)
   deleted: (at ball25 room5) (free right)
   added: (carry ball25 right)
   goals met: 19 of 36
39. (move room5 roomb)
   deleted: (at-robby room5)
   added: (at-robby roomb)
   goals met: 19 of 36
40. (drop ball25 roomb right)
   deleted: (carry ball25 right)
   added: (at ball25 roomb) (free right)
   goals met: 20 of 36
41. (drop ball26 roomb left)
   deleted: (carry ball26 left)
   added: (at ball26 roomb) (free left)
   goals met: 21 of 36
42. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 21 of 36
43. (pick ball24 room4 left)
   deleted: (at ball24 room4) (free left)
   added: (carry ball24 left)
   goals met: 21 of 36
44. (pick ball23 room4 right)
   deleted: (at ball23 room4) (free right)
   added: (carry ball23 right)
   goals met: 21 of 36
45. (move room4 roomb)
   deleted: (at-robby room4)
   added: (at-robby roomb)
   goals met: 21 of 36
46. (drop ball23 roomb right)
   deleted: (carry ball23 right)
   added: (at ball23 roomb) (free right)
   goals met: 22 of 36
47. (drop ball24 roomb left)
   deleted: (carry ball24 left)
   added: (at ball24 roomb) (free left)
   goals met: 23 of 36
48. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 23 of 36
49. (pick ball22 room4 left)
   deleted: (at ball22 room4) (free left)
   added: (carry ball22 left)
   goals met: 23 of 36
50. (pick ball21 room4 right)
   deleted: (at ball21 room4) (free right)
   added: (carry ball21 right)
   goals met: 23 of 36
51. (move room4 roomb)
   deleted: (at-robby room4)
   added: (at-robby roomb)
   goals met: 23 of 36
52. (drop ball21 roomb right)
   deleted: (carry ball21 right)
   added: (at ball21 roomb) (free right)
   goals met: 24 of 36
53. (drop ball22 roomb left)
   deleted: (carry ball22 left)
   added: (at ball22 roomb) (free left)
   goals met: 25 of 36
54. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 25 of 36
55. (pick ball20 room4 left)
   deleted: (at ball20 room4) (free left)
   added: (carry ball20 left)
   goals met: 25 of 36
56. (pick ball19 room4 right)
   deleted: (at ball19 room4) (free right)
   added: (carry ball19 right)
   goals met: 25 of 36
57. (move room4 roomb)
   deleted: (at-robby room4)
   added: (at-robby roomb)
   goals met: 25 of 36
58. (drop ball19 roomb right)
   deleted: (carry ball19 right)
   added: (at ball19 roomb) (free right)
   goals met: 26 of 36
59. (drop ball20 roomb left)
   deleted: (carry ball20 left)
   added: (at ball20 roomb) (free left)
   goals met: 27 of 36
60. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 27 of 36
61. (pick ball18 room4 left)
   deleted: (at ball18 room4) (free left)
   added: (carry ball18 left)
   goals met: 27 of 36
62. (pick ball17 room4 right)
   deleted: (at ball17 room4) (free right)
   added: (carry ball17 right)
   goals met: 27 of 36
63. (move room4 roomb)
   deleted: (at-robby room4)
   added: (at-robby roomb)
   goals met: 27 of 36
64. (drop ball17 roomb right)
   deleted: (carry ball17 right)
   added: (at ball17 roomb) (free right)
   goals met: 28 of 36
65. (drop ball18 roomb left)
   deleted: (carry ball18 left)
   added: (at ball18 roomb) (free left)
   goals met: 29 of 36
66. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 29 of 36
67. (pick ball16 room4 left)
   deleted: (at ball16 room4) (free left)
   added: (carry ball16 left)
   goals met: 29 of 36
68. (move room4 roomb)
   deleted: (at-robby room4)
   added: (at-robby roomb)
   goals met: 29 of 36
69. (drop ball16 roomb left)
   deleted: (carry ball16 left)
   added: (at ball16 roomb) (free left)
   goals met: 30 of 36
70. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 30 of 36
71. (pick ball15 room3 left)
   deleted: (at ball15 room3) (free left)
   added: (carry ball15 left)
   goals met: 30 of 36
72. (pick ball14 room3 right)
   deleted: (at ball14 room3) (free right)
   added: (carry ball14 right)
   goals met: 30 of 36
73. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 30 of 36
74. (drop ball14 roomb right)
   deleted: (carry ball14 right)
   added: (at ball14 roomb) (free right)
   goals met: 31 of 36
75. (drop ball15 roomb left)
   deleted: (carry ball15 left)
   added: (at ball15 roomb) (free left)
   goals met: 32 of 36
76. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 32 of 36
77. (pick ball4 rooma left)
   deleted: (at ball4 rooma) (free left)
   added: (carry ball4 left)
   goals met: 32 of 36
78. (pick ball3 rooma right)
   deleted: (at ball3 rooma) (free right)
   added: (carry ball3 right)
   goals met: 32 of 36
79. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 32 of 36
80. (drop ball3 roomb right)
   deleted: (carry ball3 right)
   added: (at ball3 roomb) (free right)
   goals met: 33 of 36
81. (drop ball4 roomb left)
   deleted: (carry ball4 left)
   added: (at ball4 roomb) (free left)
   goals met: 34 of 36
82. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 34 of 36
83. (pick ball2 rooma left)
   deleted: (at ball2 rooma) (free left)
   added: (carry ball2 left)
   goals met: 34 of 36
84. (pick ball1 rooma right)
   deleted: (at ball1 rooma) (free right)
   added: (carry ball1 right)
   goals met: 34 of 36
85. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 34 of 36
86. (drop ball2 roomb left)
   deleted: (carry ball2 left)
   added: (at ball2 roomb) (free left)
   goals met: 35 of 36
87. (drop ball1 roomb right)
   deleted: (carry ball1 right)
   added: (at ball1 roomb) (free right)
   goals met: 36 of 36
